Repository: xeno-by/datavault
Catalog: DataVault.UI/Properties/Resources.*.resx
Languages: ru_ru

# BrowserForm_Title
source: DataVault Browser (version {0}, format {1}) - {2}
ru_ru: Просмотр репозитория (версия {0}, формат {1}) - {2}

# CommandFailed_Message
source: Command '{0}' failed. As a result, YOUR DATA MIGHT HAVE BEEN LOST. Please, contact the developer for further instructions. Error was caused by an unhandled exception: '{1}'.
ru_ru: Команда '{0}' завершилась с ошибкой. В результате ошибки ВАШИ ДАННЫЕ МОГЛИ БЫТЬ УТЕРЯНЫ! Пожалуйста, свяжитесь с разработчиком для дальнейших инструкций. Ошибка вызвана необработанным исключением: '{1}'.

# CommandFailed_Title
source: Critical error
ru_ru: Критическая ошибка

# Confirmation_Title
source: Confirm
ru_ru: Требуется подтверждение

# MainForm_Title
source: DataVault Editor (version {0}, format {1}) - {2}
ru_ru: Редактор репозитория (версия {0}, формат {1}) - {2}

# MainForm_Title_NA
source: N/A
ru_ru: Нет файла

# New_BranchDefaultName
source: New branch {0}
ru_ru: Новая ветвь {0}

# New_ValueDefaultName
source: New value {0}
ru_ru: Новый ключ {0}

# New_ValueText
source: New &text value
ru_ru: Создать ключ &текстового типа

# Tree_Root
source: Vault
ru_ru: Репозиторий

# Validation_DuplicateBranchName
source: Branch with the name '{0}' already exists
ru_ru: Ветвь с именем '{0}' уже существует

# Validation_DuplicateValueName
source: Value with the name '{0}' already exists
ru_ru: Ключ с именем '{0}' уже существует

# Validation_InvalidFsVault
source: Underlying folder is corrupted or not a fs vault
ru_ru: Папка повреждена или не является корневой папкой репозитория

# Validation_InvalidName
source: '{0}' is not a valid name
ru_ru: Имя '{0}' содержит недопустимые символы

# Validation_InvalidXmlVault
source: Underlying file is corrupted or not an xml vault
ru_ru: Файл поврежден или не является файлом xml-репозитория

# Validation_InvalidZipVault
source: Underlying file is corrupted or not a zip vault
ru_ru: Файл поврежден или не является файлом zip-репозитория

# Validation_Title
source: Validation failed
ru_ru: Ошибка

# Validation_ValueTypeNotSelected
source: Please, select the type
ru_ru: Тип ключа обязателен для заполнения

# ValueType_NotSelected
source: (not selected)
ru_ru: (не задан)

# ValueType_Text
source: Text
ru_ru: Текст

source: (default)
ru_ru: (по умолчанию)

# VaultFormat_ExistingFsVault_Message
source: The uri you've selected already hosts a repository. To proceed the DataVault editor needs to delete it. Do you wish to continue?
ru_ru: В выбранной папке уже хранится репозиторий. Для того, чтобы выполнить текущую операцию, необходимо его удалить. Вы действительно желаете продолжить?

# VaultFormat_ExistingFsVault_Title
source: Confirm
ru_ru: Требуется подтверждение

# VaultFormat_NoIndexFileFsUri_Message
source: The uri you've selected doesn't contain an index file of an fs vault. Opening such vault might still be possible tho it might take excessive amount of time or even crash. Do you wish to continue?
ru_ru: Выбранная папка не содержит индексного файла репозитория. Открытие такой папки может пройти успешно, но может занять исключительно долгое время или даже закончиться ошибкой. Вы действительно желаете продолжить?

# VaultFormat_NoIndexFileFsUr_Title
source: Confirm
ru_ru: Требуется подтверждение

# VaultFormat_NonEmptyFsUri_Message
source: The uri you've selected is not empty. Thus, during its work the DataVault editor might overwrite existing files or directories if it will be required for storing vault data. Do you wish to continue?
ru_ru: Выбранная папка непуста. Во время работы редактор репозитория может удалить существующие там файлы и/или папки, если того потребует необходимость сохранения содержимого репозитория. Вы действительно желаете продолжить?

# VaultFormat_NonEmptyFsUri_Title
source: Confirm
ru_ru: Требуется подтверждение

# Version_Empty
source: N/A
ru_ru: неизвестная

# Version_UpgradeFailed
source: Upgrading vault from version '{0}' to version '{1}' (current) has failed. No data was lost, but you won't be able to work with the vault using the current version of the application.
ru_ru: Приложению не удалось конвертировать репозиторий из версии '{0}' в версии '{1}'. Данные не были потеряны, но вы не сможете работать с этим репозиторием в текущей версии приложения.

# Version_UpgradeFailed_Title
source: Upgrade failed
ru_ru: Ошибка

# Version_UpgradeSucceeded
source: Upgrading vault from version '{0}' to version '{1}' (current) has been successfully completed. Now you can proceed to working with the vault.
ru_ru: Репозиторий был успешно конвертирован из версии '{0}' в версию '{1}'. Теперь вы можете продолжить работу с репозиторием.

# Version_UpgradeSucceeded_Title
source: Upgrade succeeded
ru_ru: Операция успешно завершена

# Version_UpgradeVaultToLatestVersion
source: The vault you're opening has version '{0}' that doesn't match current version of the application ('{1}'). Do you wish to upgrade it? If you decline the upgrade, the vault will not be opened and you won't be able to work with it using the current version of the application. If you approve the upgrade, the vault will be converted to the new format, and its content will possibly undergo certain changes. However, before the upgrade the application will first make a backup of the vault, so not data will be lost.
ru_ru: Версия открываемого репозитория ({0}) отличается от текущей версии приложения ({1}). Для того, чтобы продолжить работу с репозиторием, его необходимо конвертировать в новую версию. Продолжить? Если вы отмените конвертацию, репозиторий не будет открыт, и вы не сможете работать с данным репозиторием в текущей версии приложения. Если вы подтвердите конвертацию, программа попытается обновить файл репозитория до соответствия текущей версии. Во время этого процесса содержимое репозитория может измениться. Тем не менее, опасности потери данных нет, потому что перед конвертацией программа создаст резервную копию конвертируемого файла.

# Validation_SourceAndTargetOfExportImportAreTheSame
source: Source and target uris of an export or import operation cannot be the same.
ru_ru: Репозиторий-источник и целевой репозиторий операции экспорта или импорта не могут совпадать.

# Import_Precaution_Message
source: The import operation will replace all content of the vault being edited. Do you wish to continue?
ru_ru: Операция импорта безвозвратно удалит все данные редактируемого репозитория. Продолжить?

# Import_Precaution_Title
source: Confirm
ru_ru: Требуется подтверждение

# New_ValueBinary
source: New &binary value
ru_ru: Создать ключ типа &файл

# ValueType_Binary
source: Binary
ru_ru: Файл

# BinaryType_ContentStringStub
source: <binary>
ru_ru: <файл>

# BinaryType_ContentCleared
source: <content has been cleared>
ru_ru: <значение ключа пусто>

# BinaryType_ContentNotEditedYet
source: <content has not been edited yet>
ru_ru: <значение ключа еще не редактировалось>

# BinaryType_ConfirmExtractionToView
source: This will extract the file into a temporary directory and attempt to open it with an appropriate software. Do you wish to continue?
ru_ru: Редактор произведет извлечение файла во временную папку и попытается открыть его подходящей программой. Продолжить?

# Error_Title
source: Error
ru_ru: Ошибка

# New_MetadataSectionDefaultName
source: New section {0}
ru_ru: Новая секция {0}

# DefaultEditMetadataForm_SectionTab_Content
source: Content:
ru_ru: Данные:

# DefaultEditMetadataForm_SectionTab_Name
source: Name:
ru_ru: Название:

# ValueType_Unknown_Fatal
source: Failed to process value with content type '{0}'. Make sure that you have all plugins to DataVault.UI that were used to create the vault.
ru_ru: Невозможно обработать ключ типа '{0}'. Убедитесь в том, что у вас установлены плагины, использованные для создания данного репозитория.

# ValueType_Unknown_Warning
source: <unknown: {0}>
ru_ru: (неизвестный: {0})

# VaultFormat_Fs_DialogTitle_Create
source: Creating a vault > Select a directory to store vault's files
ru_ru: Создание репозитория > Выберите корневую папку репозитория

# VaultFormat_Fs_DialogTitle_Export
source: Exporting into a vault > Select a directory that stores target vault's files
ru_ru: Экспорт в репозиторий > Выберите корневую папку репозитория-приемника

# VaultFormat_Fs_DialogTitle_Import
source: Importing from a vault > Select a directory that stores source vault's files
ru_ru: Импорт из репозитория > Выберите корневую папку репозитория-источника

# VaultFormat_Fs_DialogTitle_Open
source: Opening a vault > Select a directory that stores vault's files
ru_ru: Открытие репозитория > Выберите корневую папку репозитория

# VaultFormat_Xml_DialogTitle_Create
source: Creating a vault > Select a file in xml format
ru_ru: Создание репозитория > Выберите файл в формате xml

# VaultFormat_Xml_DialogTitle_Export
source: Exporting into a vault > Select target file in xml format
ru_ru: Экспорт в репозиторий > Выберите файл-приемник в формате xml

# VaultFormat_Xml_DialogTitle_Import
source: Importing from a vault > Select source file in xml format
ru_ru: Импорт из репозитория > Выберите файл-источник в формате xml

# VaultFormat_Xml_DialogTitle_Open
source: Opening a vault > Select a file in xml format
ru_ru: Открытие репозитория > Выберите файл в формате xml

# VaultFormat_Zip_DialogTitle_Create
source: Creating a vault > Select a file in zip format
ru_ru: Создание репозитория > Выберите файл в формате zip

# VaultFormat_Zip_DialogTitle_Export
source: Exporting into a vault > Select target file in zip format
ru_ru: Экспорт в репозиторий > Выберите файл-приемник в формате zip

# VaultFormat_Zip_DialogTitle_Import
source: Importing from a vault > Select source file in zip format
ru_ru: Импорт из репозитория > Выберите файл-источник в формате zip

# VaultFormat_Zip_DialogTitle_Open
source: Opening a vault > Select a file in zip format
ru_ru: Открытие репозитория > Выберите файл в формате zip

# Dialogs_BrowseForFile_FileNameLabel
source: File name:
ru_ru: Имя файла:

# Dialogs_BrowseForFolder_FolderNameLabel
source: Folder name:
ru_ru: Имя папки:

# Dialogs_BrowseForFile_ConfirmOverwrite_Message
source: This operation will overwrite the file you've selected. Do you wish to continue?
ru_ru: Операция необратимо изменит выбранный файл. Подолжить?

# Dialogs_BrowseForFile_ConfirmOverwrite_Title
source: Confirm
ru_ru: Требуется подтверждение

# Dialogs_BrowseForFolder_ConfirmOverwrite_Message
source: This operation will overwrite the folder you've selected. Do you wish to continue?
ru_ru: Операция необратимо изменит выбранную папку. Подолжить?

# Dialogs_BrowseForFolder_ConfirmOverwrite_Title
source: Confirm
ru_ru: Требуется подтверждение

# VaultFormat_ExistingFileBasedVault_Message
source: The uri you've selected already hosts a vault. To proceed the DataVault editor needs to delete it. Do you wish to continue?
ru_ru: В выбранном файле уже хранится репозиторий. Для того, чтобы выполнить текущую операцию, необходимо его удалить. Вы действительно желаете продолжить?

# Dialogs_BrowseForFile_FolderIsNotValidHere_Message
source: Folder is not a valid selection for this dialog. Please, select a file.
ru_ru: В этом диалоге нельзя выбрать папку. Пожалуйста, выберите файл.

# Dialogs_BrowseForFile_FolderIsNotValidHere_Title
source: Error
ru_ru: Ошибка

# Dialogs_BrowseForFolder_FileIsNotValidHere_Message
source: File is not a valid selection for this dialog. Please, select a folder.
ru_ru: В этом диалоге нельзя выбрать файл. Пожалуйста, выберите папку.

# Dialogs_BrowseForFolder_FileIsNotValidHere_Title
source: Error
ru_ru: Ошибка

# Dialogs_BrowseForFile_NotAFileSystemLocation_Message
source: The file name you've entered doesn't point to a valid location in a file system. Please, select another file.
ru_ru: Выбранный файл не поддерживается файловой системой. Пожалуйста, выберите другой файл.

# Dialogs_BrowseForFile_NotAFileSystemLocation_Title
source: Error
ru_ru: Ошибка

# Dialogs_BrowseForFolder_NotAFileSystemLocation_Message
source: The folder name you've entered doesn't point to a valid location in a file system. Please, select another folder.
ru_ru: Выбранная папка не поддерживается файловой системой. Пожалуйста, выберите другую папку.

# Dialogs_BrowseForFolder_NotAFileSystemLocation_Title
source: Error
ru_ru: Ошибка

# Dialogs_BrowseForFile_FileDoesNotExist_Message
source: The file you've selected doesn't exist. Please, select an existing file.
ru_ru: Выбранный вами файл не существует. Пожалуйста, выберите существующий файл.

# Dialogs_BrowseForFile_FileDoesNotExist_Title
source: Error
ru_ru: Ошибка

# Dialogs_BrowseForFolder_FolderDoesNotExist_Message
source: The folder you've selected doesn't exist. Please, select an existing folder.
ru_ru: Выбранная вами папка не существует. Пожалуйста, выберите существующую папку.

# Dialogs_BrowseForFolder_FolderDoesNotExist_Title
source: Error
ru_ru: Ошибка

# Views_CanOnlyPopTopView_Message
source: You can only discard the last activated view. To deactivate this view, first discard all views that were activated prior to this one (they're displayed below in the "Active" section of the "Views" menu).
ru_ru: Можно отменить только последную из активированных проекций. Для того, чтобы отменить выбранную проекцию, вначале отмените все проекции активированные до нее (они отображены ниже в секции "Активные" меню "Проекции").

# Views_CanOnlyPopTopView_Title
source: Error
ru_ru: Ошибка

# Views_UnknownSingle_Warning
source: History of previously opened views cannot be loaded. Editor doesn't support view with name '{0}'. Make sure that you have all plugins to DataVault.UI that were used to create the vault. For now, DataVault editor can either proceed without loading unsupported view and fix the history, or close the vault to avoid possible loss of data. Do you wish to continue working with the vault?
ru_ru: Информация о ранее открытых проекциях не может быть загружена. Редактор не поддерживает проекцию '{0}'. Убедитесь в том, что у вас установлены плагины, использованные для создания данного репозитория. На текущий момент редактор может либо продолжить работу с репозиторием, удалив запись о неизвестной проекции и опустив загрузку неизвестной проекции, либо завершить работу, чтобы избежать возможной потери данных. Продолжить работу с репозиторием?

# Views_UnknownMultiple_Warning
source: History of previously opened views cannot be loaded. Editor doesn't support views with names '{0}'. Make sure that you have all plugins to DataVault.UI that were used to create the vault. For now, DataVault editor can either proceed without loading unsupported views and fix the history, or close the vault to avoid possible loss of data. Do you wish to continue working with the vault?
ru_ru: Информация о ранее открытых проекциях не может быть загружена. Редактор не поддерживает проекции '{0}'. Убедитесь в том, что у вас установлены плагины, использованные для создания данного репозитория. На текущий момент редактор может либо продолжить работу с репозиторием, удалив записи о неизвестных проекциях и опустив загрузку неизвестных проекций, либо завершить работу, чтобы избежать возможной потери данных. Продолжить работу с репозиторием?

# Views_CorruptedViewNote_Message
source: History of previously opened views is corrupted and cannot be loaded. For now, DataVault editor can either proceed without loading any views and fix the history, or close the vault to avoid possible loss of data. Do you wish to continue working with the vault?
ru_ru: Информация о ранее открытых проекциях повреждена и не может быть загружена. На текущий момент редактор может либо продолжить работу с репозиторием, устранив повреждения и не загружая никаких проекций, либо завершить работу, чтобы избежать возможной потери данных. Продолжить работу с репозиторием?

# Views_CorruptedViewNote_Title
source: Error
ru_ru: Ошибка

# Version_UnknownVersion
source: The vault you're opening has an unknown version '{0}'. You won't be able to work with the vault using the current version of the application. Please, contact your system administrator.
ru_ru: Открываемый репозиторий имеет неизвестную версию {0}. Вы не сможете работать с данным репозиторием в текущей версии приложения. Пожалуйста, свяжитесь с администратором для дальнейших инструкций.

# Version_UnknownVersion_Title
source: Error
ru_ru: Ошибка

# ShellIntegration_UnknownFormat_Message
source: Cannot open vault at url '{0}'. It has unrecognized format (attempted the following formats: {1}).
ru_ru: Невозможно открыть репозиторий по адресу '{0}'. Его формат не поддерживается ни одним из модулей приложения ({1}).

# ShellIntegration_UnknownFormat_Title
source: Error
ru_ru: Ошибка

# Views_MenuItem_Template
source: {0} (version {1})
ru_ru: {0} (версия {1})

# CloseVaultWhenDirty_Buttons
source: Save and Close | Don't Save | {Cancel}
ru_ru: Сохранить и закрыть | Не сохранять | {Cancel}

# CloseVaultWhenDirty_Message
source: The operation you're about to perform will close current vault. However this vault has some unsaved changes. Please, resolve the conflict. * "Save and Close" will save changes to the vault and then close it. * "Don't Save" will close the vault and discard all unsaved changes. * "Cancel" will cancel the operation and leave the vault open to perform manual fixup.
ru_ru: Операция, которую вы собираетесь выполнить, закроет текущий репозиторий. Однако этот репозиторий содержит несохраненные изменения. Необходимо ваше вмешательство для разрешения конфликта. * "Сохранить и закрыть" сохранит репозиторий на диск и потом закроет его. * "Не сохранять" просто закроет репозиторий, отменив текущие изменения. * "Отмена" отменит текущую операцию и оставит репозиторий открытым для ручной обработки конфликта.

# CloseVaultWhenDirty_Title
source: Attention Required
ru_ru: Необходимо вмешательство

# CustomMessageBox_Ok
source: ОК
ru_ru: Ok

# CustomMessageBox_Cancel
source: Отмена
ru_ru: Cancel

# CustomMessageBox_Yes
source: Да
ru_ru: Yes

# CustomMessageBox_No
source: Нет
ru_ru: No

# CustomMessageBox_Abort
source: Прервать
ru_ru: Abort

# CustomMessageBox_Retry
source: Повторить
ru_ru: Retry

# CustomMessageBox_Ignore
source: Пропустить
ru_ru: Ignore

# ExitFailedDueToAnException_Message
source: Your exit attempt has just failed due to an unexpected error. If this error persists the application wouldn't be able to shut down by itself. The best bet would be to contact the developer for further instructions. Another option would be to forcibly close the application with a danger of DATA LOSS. Do you wish to force application exit and accept risks of potential data loss (Yes) or return to application and try again (No)?
ru_ru: Ваша попытка закрыть приложение завершилась неожиданной ошибкой. Пока эта проблема не будет разрешена приложение не сможет закрыться самостоятельно. Лучшим решением будет связаться с разработчиком для дальнейших инструкций. Также возможен вариант принудительного закрытия приложения, но он опасен возможностью дальнейшей ПОТЕРИ ДАННЫХ. Продолжить закрытие приложения и принять риск потенциальной потери данных (Да) или вернуться в приложение и попытаться исправить ситуацию (Нет)?

# ExitFailedDueToAnException_Title
source: Critical error
ru_ru: Критическая ошибка
